_posts/2023-08-14-AI-governance-course-explainer.html
---
layout: article
title: BlueDot Impact AI Governance course
tags: AI AI-governace-course
license: true
show_subscribe: true
show_edit_on_github: false
---
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5ba87a2">The course</a>
<ul>
<li><a href="#org164d48d">Why I chose to do this?</a></li>
</ul>
</li>
<li><a href="#org8fcce5a">Sharing my progress</a>
<ul>
<li><a href="#org2bf5124">AI Governance course post series</a></li>
</ul>
</li>
<li><a href="#org7c67023">Other interest in AI</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5ba87a2" class="outline-2">
<h2 id="org5ba87a2">The course</h2>
<div class="outline-text-2" id="text-org5ba87a2">
<p>
I've been accepted into the August cohort of BlueDot Impact's <a href="https://course.aisafetyfundamentals.com/governance">AI Safety Fundamentals: Governance Course</a>.
The course consists of 8 weeks of self-guided learning in combination with group discussions to get me up to speed on the extreme risk from AI and governance approaches to mitigating these risks.
One thing that I love about the course is that the curriculum is freely published online.
</p>
</div>

<div id="outline-container-org164d48d" class="outline-3">
<h3 id="org164d48d">Why I chose to do this?</h3>
<div class="outline-text-3" id="text-org164d48d">
<p>
Spending ~5 hours a week reading about a <a href="https://course.aisafetyfundamentals.com/governance?week=1">relatively technical topic</a> and discussing it with a small group of strangers is a non-trivial commitment, so why am I doing it?
My motivations are two-fold.
</p>

<p>
Firstly, at <a href="https://www.highimpactengineers.org/">High Impact Engineers</a> we think that working to reduce the risk from AI is one of the cause areas for which engineers are particularly well suited.
Not everyone is interested in, or a good fit for, doing technical <a href="https://course.aisafetyfundamentals.com/alignment">AI alignment</a> work but there are other ways to contribute to reducing the risks posed by AI, such as working in AI governance.
Engineers are good at thinking in systems and often work to design things that have human safety as a central objective &#x2013; think cars, bridges, electronics, trains, biomedical devices, etc. &#x2013; so I think engineers could be very well suited to working on AI governance.
I did some narrow research into the field while I was preparing for <a href="http://engineeredforimpact.show/lennart">my conversation with Lennart Heim for the Engineered for Impact podcast</a> but I felt like I had only really scratched the surface.
So I want to broaden my understanding of the field and better understand where engineers can effectively contribute.
</p>

<p>
My second reason is more personally motivated.
I think engineers could be good in AI governance; I'm an engineer; so how could I be contributing to AI governance?
Not only do I want to answer this question but I'd also like to use the course as a low-risk test of my personal fit for working in the AI governance field.
</p>
</div>
</div>
</div>

<div id="outline-container-org8fcce5a" class="outline-2">
<h2 id="org8fcce5a">Sharing my progress</h2>
<div class="outline-text-2" id="text-org8fcce5a">
<p>
Each week of the course comprises some readings, a short essay writing task, and a 2-hour group discussion.
I intend to publish my essay here on my blog as well as some key takeaways from the group discussion.
I think this will give me a framework in which to better reflect on the discussions and document my current thinking on the topics.
</p>

<p>
Over the past few years, I've found writing to be a good way to summarise my learning and also interrogate my thoughts on a topic.
Throughout my PhD, I started keeping more extensive notes and documentation on useful resources I had found and my decision-making or thought process.
It's really easy to just jump consuming content online when I get interested in a topic but I run the risk of learning interesting things only to forget them or vaguely remember them but not where I learnt about them &#x2013; this is almost worse because it's really frustrating when this happens.
Having this second brain of notes was, and continues to be, immensely valuable.
So this is why I think writing up my thoughts after the weekly discussion will be valuable to me.
It's also a way to show my work.
In my <a href="http://engineeredforimpact.show/soroush">conversation with Soroush Pour</a>, he highlighted <a href="https://www.youtube.com/watch?v=WpWX9S4p6r8&amp;t=1552s">the value of showing your work</a> and allowing other to join you on your journey.
This course seems like a great opportunity to take Soroush's advice and run with it!
</p>
</div>

<div id="outline-container-org2bf5124" class="outline-3">
<h3 id="org2bf5124">AI Governance course post series</h3>
<div class="outline-text-3" id="text-org2bf5124">
<p>
I'll update this list as I publish posts:
</p>
<ul class="org-ul">
<li>Week 1: <a href="/2023/08/15/AI-governance-course-can-AI-progress-continue-at-the-current-pace.html">Can AI progress continue at the current pace?</a></li>
<li>Week 2: <a href="/2023/08/24/AI-governance-course-2-risk-of-harm-from-AI-misuse-accident-rogue-AI.html">The likelihood of risks arrising from  misuse, accident, or rogue, agentic AI systems causing harm</a></li>
</ul>
</div>

<div id="outline-container-org45001ca" class="outline-4">
<h4 id="org45001ca">Disclaimer on my response to the essay tasks</h4>
<div class="outline-text-4" id="text-org45001ca">
<p>
My response to the essay prompt is typically written in over 1-2 hours and not heavily edited, unless I indicate otherwise.
You can treat the essays as a writing exercise whose objective is to get me to more deeply engage with the topics of the week's readings and practice writing essays.
</p>

<p>
The degree to which I agree with, or am certain about, the claims I make in each essay will vary.
I may convey greater certainty in the ideas or arguments than I actually have.
I haven’t made a deliberate attempt to express my level of uncertainty in the arguments I present.
I don’t think this is required to achieve my objectives for the essays and expressing uncertainty could conceivably take me twice as long to reflect on my uncertainties of each argument as it has to write the essay — which becomes an intractable length of time thus defeating the purpose of the exercise.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org7c67023" class="outline-2">
<h2 id="org7c67023">Other interest in AI</h2>
<div class="outline-text-2" id="text-org7c67023">
<p>
As somewhat of an aside, I've also developed an interest in <a href="https://www.neelnanda.io/mechanistic-interpretability/getting-started">mechanistic interpretability</a> (MI) after attending a presentation by <a href="https://www.neelnanda.io/">Neel Nanda</a> on the topic at EAG London earlier this year.
MI is a "field of study of reverse engineering neural networks from the learned weights down to human-interpretable algorithms. Analogous to reverse engineering a compiled program binary back to source code" (<a href="https://dynalist.io/d/n2ZWtnoYHrU1s4vnFSAQ519J">reference</a>).
This is quite different from AI governance, however, I think there could be an intersection of the two fields where MI is used as a mechanism by which to do governance.
</p>
</div>
</div>
